tutorials/10.1.4.1D_2phase_4componentGas_YCO2i_0_compositionalDarcyFoam_mutual_slbty_U_0.005_den_mu_Ns_0_longer_time/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

cp 0.orig 0 -R

runApplication blockMesh

runApplication $(getApplication)

#------------------------------------------------------------------------------